/*************************************************************************
    > File Name: 5_19.c
    > Author: Amano Sei
    > Mail: amano_sei@outlook.com 
    > Created Time: 2019年10月20日 星期日 18时33分41秒
 ************************************************************************/

#include <stdio.h>

//这个我有点不明白书上的做法，2次展开3次加，4次展开5次加
//下面的做法说来惭愧（是我抄来的
//不过我没有找到其他真的有优化的做法了
//我也觉得想不到其他更好的做法了（
//这里的CPE下界只看关键路径的话是1/3*3=1，但是感觉容量1，延迟3的浮点加不能并行运行所有的浮点加（所以其实是5*1/1/3=1.67（emmm刚好是书上的cpe呢
void psum1(float a[], float p[], long n){
    long i;
    float t = 0;
    for(i = 0; i < n-2; i+=3){
        float t1 = a[i];
        float t2 = t1+a[i+1];
        float t3 = t2+a[i+2];
        p[i] = t+t1;
        p[i+1] = t+t2;
        p[i+2] = t = t+t3;
    }
    while(i < n){
        p[i] = t = t+a[i];
        i++;
    }
}

